/************************************************************************************************
*                                        (c) COPYRIGHT by ZAO NPK PELENGATOR                    *
*                                            All rights reserved.                               *
*************************************************************************************************
* Module      : Ab_arm_codec.c
*
* Description : Видимо Здесь будет интерфейс между ARM-CORTEX A8  и PRU-RISC сопроцессорами.
*
* Author      : Konstantin Shiluaev.
*
******************************************************************************/
/****************************************************************************
**                  FUNCTION DEFNITION
****************************************************************************/

#if 0

/*****************************************************************************
Syntax:      	    int writel(unsigned int val ,void * addr)
Return Value:	    write to reg value
*******************************************************************************/
int writel(unsigned int val ,void * addr)
{

	HWREG(addr)  = val;

}
/*****************************************************************************
Syntax:      	    int readl(void * addr)
Return Value:	    Returns 1 reg value.
*******************************************************************************/
int readl(void * addr)
{

	return HWREG(addr);
}


#endif


